In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
lst = {1: 'Nourah', 2: 'Sarah', 3: 'Ahmed'}
s1 = pd.Series(lst)
print(s1)

1    Nourah
2     Sarah
3     Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
s1.index = [11, 12, 13]
s1

11    Nourah
12     Sarah
13     Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
print(s1[0:2])

11    Nourah
12     Sarah
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
# Add elements 
s2 = pd.Series({50: 'Ahmed', 60: 'Khaled'})
s1 = s1.append(s2)
print(s1)
# drop duplicate elements
print(s1.drop_duplicates())

11    Nourah
12     Sarah
13     Ahmed
50     Ahmed
60    Khaled
dtype: object
11    Nourah
12     Sarah
13     Ahmed
60    Khaled
dtype: object

/var/folders/cc/hrcjmc7j2631f9q1c6_9syfr0000gn/T/ipykernel_4281/312714672.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s1 = s1.append(s2)

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [6]:
data = {'ID': ['1111111', '2222222', '3333333'],
        'Name': ['Sarah', 'Lama', 'Nourah'],
        'GPA': [3.5, 4.5, 3.57]
       }

Students = pd.DataFrame(data, columns=['ID', 'Name', 'GPA'])
Students

        ID    Name   GPA
0  1111111   Sarah  3.50
1  2222222    Lama  4.50
2  3333333  Nourah  3.57

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [7]:
edu = pd.read_csv('/Users/mac/Downloads/educ_figdp_1_Data.csv')
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [8]:
edu.loc[5:10,:]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e

In [9]:
edu[10:16]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e